{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 Hi, I'm Jennifer and I am an alumni of Southern Alberta Institute of Technology (SAIT) in Calgary, Canada. I majored in Software Development. I previously worked at GuildOne Inc. until 2020 and I am currently working as a developer at Morgan Stanley.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Animal Shelter",
        "startDate": "2020",
        "description": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
        "images": [
          "images/portfolio/animal-shelter/p1.jpg",
          "images/portfolio/animal-shelter/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Morgan Stanley",
        "title": "Software Developer",
        "years": "Jun 2020 - present",
        "blurb": "lorem",
        "mainTech": [
          "Java",
          "Oracle Database"
        ],
        "technologies": [
          "REST API",
          "Spring",
          "Struts",
          "React",
          "React Native",
          "Selenium"
        ]
      },
      {
        "company": "Guild One Inc.",
        "title": "Software Engineer",
        "years": "May 2018 - April 2020",
        "blurb": "GuildOne Inc. is a Calgary software company that provides advanced data solutions and business intelligence to oil and gas companies. In 2018, GuildOne conducted the world’s first blockchain oil and gas royalty transaction on Energy Block Exchange (EBX), its blockchain business network for energy transactions. \n\nAt GuildOne, I primarily worked on ConTracks, the world's first O&G royalty transaction. During my time on ConTracks, I was able to get Corda certified! This meant that I have a solid knowledge of blockchain concepts such as blocks, transactions, consensus, UTXO, smart contracts, public key cryptography. As well, I am able to contribute, read and maintain Corda applications. The ConTracks software has many different moving parts, I work primarily on the front end and the middle layer where the API communicates to the blockchain layer.\n\nAs part of the team working on ConTracks, I helped research in the implementation of a new web interface. Previously, ConTracks was available only as a desktop application. Since the application was written in the Scala programming language, I decided to use Scala.js. Scala.js is a compiler that compiles Scala source code to equivalent JavaScript code. With this ability to convert Scala code to JavaScript, I was able to use React as our front end. This is my first exposure to React, and so far, it's easy to see why it's one of JavaScript's most popular front end frameworks!\n\nI also help develop an internal documentation site where GuildOne employees could go and look up either business related information about a product, to technical documentation about API endpoints to blockchain concepts used. This is a great opportunity for me to learn more about pipelines that are used in BitBucket and Docker Hub. I also help maintain the technical aspect of GuildOne's website by keeping the development environment separate from the live site using an Ubuntu server.",
        "mainTech": [
          "Scala",
          "Java",
          "Neo4J",
          "MySQL"
        ],
        "technologies": [
          "Corda",
          "JavaFX",
          "WordPress",
          "Docker"
        ]
      },
      {
        "company": "Blue Ocean Interactive Marketing",
        "title": "Web Developer",
        "years": "Sept 2016 - April 2018",
        "blurb": "Blue Ocean is a Calgary based company that services clients around North America with custom web designs and online marketing company. Blue Ocean was able to give me my first job into the web development world where I was able to feel like part of a team that was capable of making an impact. I worked on many projects in different fields from the Catholic education system to helping a drain service bring their ideas and services to life",
        "mainTech": [
          "PHP",
          "MySQL",
          "HTML/CSS",
          "JavaScript/jQuery",
          "Ajax",
          "Bootstrap"
        ],
        "technologies": [
          "Wordpress",
          "Joomla"
        ]
      }
    ]
  }